tap "homebrew/bundle"
tap "homebrew/core"

# CLI necessities 
brew "ag"
brew "tmux"
brew "gh"
brew "fzf"

# CLI extras
brew "wtfutil"

# Other tools
brew "gnupg"
brew "gradle"
brew "highlight"
brew "imagemagick"
brew "watchman"
brew "wget"

# Version managers
brew "asdf"
brew "chruby"
brew "ruby-install"
brew "nvm"
cask "xcodes"
cask "adoptopenjdk/openjdk/adoptopenjdk8"

# I just need this
brew "libffi"

# iOS / macOS 
brew "swiftformat"
brew "swiftlint"
brew "xcbeautify"
